<div id="map" style="width: 100%; height: 500px"></div>

        ymaps.ready(init);
 
        function init () {
            var myMap = new ymaps.Map("rec269108779", {
                    center: [58.012624, 56.251111],
                    zoom: 10
                }),
            myPolygon = new ymaps.Polygon([[
				[58.01808997506885,56.22433718961321],
				[58.02774448293615,56.27171572965227],
				[58.041037919420646,56.300211518226504],
				[58.030658537378244,56.31978091519917],
				[58.00478797388226,56.32252749723041],
				[57.9863756504197,56.29506167691791],
				[57.97251456603163,56.29986819547261],
				[57.95773564225153,56.265535920081994],
				[57.962115220189546,56.211977570472605],
				[57.96722404919179,56.146402924476504],
				[58.001142723793684,56.14022311490617],
				[58.012623999945724,56.162882416664026],
				[58.01808997506885,56.22433718961321]
            ]], {
                    //Свойства
                    hintContent: "Многоугольник"
                }, {
                    // Опции.
                    // Цвет заливки (красный)
                    fillColor: '#fff826',
                    // Прозрачность (полупрозрачная заливка)
                    opacity: 0.6
                });
            myMap.geoObjects.add(myPolygon);
			myPlacemark = new ymaps.Placemark([58.012624, 56.251111], { content: 'Россия, Пермь, улица 25 Октября, 24', balloonContent: 'Россия, Пермь, улица 25 Октября, 24' });	
			myMap.geoObjects.add(myPlacemark);
			
			myPolygon.events.add('click', function () {
				alert('О, событие!');
			});
        }